# Python for Data Analysis

In [2]:
#Import Python Libraries
import numpy as np
import pandas as pd

In [12]:
print(pd. __version__)

2.1.4

Pandas is a python package that deals mostly with :

- __Series__ (1d homogeneous array)
- __DataFrame__ (2d labeled heterogeneous array)
- __Panel__ (general 3d array)

# Pandas  _DataFrame_  is two-dimensional, size-mutable, heterogeneous tabular data structure with #labeled rows and columns ( axes ). Can be thought of a dictionary-like container to store #python Series objects.

In [72]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
print("numpy sorted score",np.sort(score))
print("score",score)

numpy sorted score [ 7 20 25 25 29 32 35 44 44 47 56 58 59 63 67 74 75 82 84 85]
score [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]

In [73]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
print(sorted(score))
print(score)

[7, 20, 25, 25, 29, 32, 35, 44, 44, 47, 56, 58, 59, 63, 67, 74, 75, 82, 84, 85]
[25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]

In [74]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
score.sort(reverse=True)
print(score)

[85, 84, 82, 75, 74, 67, 63, 59, 58, 56, 47, 44, 44, 35, 32, 29, 25, 25, 20, 7]

In [75]:
score = [25, 47, 84, 74, 44, 35, 75, 7, 29, 82, 32, 25, 20, 63, 44, 58, 59, 67, 56, 85]
print(np.mean(score))
print(np.std(score))
print("min = ", np.min(score))
# หา max

50.55
22.70346889794597
min =  7

In [104]:
#Read csv file แบบอาจารย์
#df = pd.read_csv("D:/D-MISC-Download/520215-DA-67-1/Midterm/Lab/Data/Salaries.csv")

#Read csv file
df = pd.read_csv("Salaries.csv")

In [77]:
#Display a few first records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [78]:
#Display first 10 records
df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [79]:
#Display the last 3 records
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [80]:
# Display lecturers who are Male
df['sex']=="female"

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75    False
76    False
77    False
Name: sex, Length: 78, dtype: bool

In [81]:
# Display lecturer who are Male with all ranks
df[["sex","rank"]]

       sex       rank
0     Male       Prof
1     Male       Prof
2     Male       Prof
3     Male       Prof
4     Male       Prof
..     ...        ...
73  Female       Prof
74  Female  AssocProf
75  Female       Prof
76  Female       Prof
77  Female       Prof

[78 rows x 2 columns]

In [82]:
#Display first 20 records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [83]:
#Display the last 5 records
# <your code goes here>
df.tail(5)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [84]:
#Identify the type of df object
#type(df)
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [85]:
#Check the type of a column "salary"
df['salary'].dtype

dtype('int64')

In [86]:
#List the types of all columns
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [87]:
#List the column names
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [88]:
#List the row labels and the column names
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [89]:
#Number of dimensions
df.ndim

2

In [90]:
#Total number of elements in the Data Frame
df.size

468

In [91]:
468
#Number of rows and columns
df.shape

(78, 6)

In [92]:
(78, 6)
#Output basic statistics for the numeric columns
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [93]:
#Calculate mean for all numeric columns
df.mean(numeric_only=True) #for pandas version 2.2.2
#df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [103]:
np.mean(df['salary'])

108023.78205128205

In [94]:
#Calculate mean for service columns
#df['service'].mean()
np.mean(df['service'])

15.051282051282051

## Exercise

In [95]:
np.sort(df.salary)

array([ 57800,  62884,  63100,  71065,  72500,  72500,  73000,  73300,
        73500,  74692,  74830,  75044,  77000,  77500,  77500,  78500,
        80225,  81285,  85000,  88000,  90450,  91000,  91000,  91100,
        91300,  92000,  92000,  92000,  93000,  94350,  97032,  99418,
       102000, 103106, 103275, 103613, 103750, 103994, 104542, 104800,
       105000, 105450, 107008, 107300, 109646, 109650, 109954, 110515,
       111512, 116450, 117555, 119800, 120000, 122400, 122960, 123683,
       124312, 126300, 126933, 127512, 128250, 129000, 131205, 134778,
       137000, 140096, 144651, 146856, 148750, 150480, 150500, 151768,
       153750, 155750, 155865, 161101, 162200, 186960], dtype=int64)

In [96]:
print(sorted(df.salary, reverse=True))

[186960, 162200, 161101, 155865, 155750, 153750, 151768, 150500, 150480, 148750, 146856, 144651, 140096, 137000, 134778, 131205, 129000, 128250, 127512, 126933, 126300, 124312, 123683, 122960, 122400, 120000, 119800, 117555, 116450, 111512, 110515, 109954, 109650, 109646, 107300, 107008, 105450, 105000, 104800, 104542, 103994, 103750, 103613, 103275, 103106, 102000, 99418, 97032, 94350, 93000, 92000, 92000, 92000, 91300, 91100, 91000, 91000, 90450, 88000, 85000, 81285, 80225, 78500, 77500, 77500, 77000, 75044, 74830, 74692, 73500, 73300, 73000, 72500, 72500, 71065, 63100, 62884, 57800]

In [97]:
#Calculate the standard deviation (std() method) for all numeric columns
df.std(numeric_only=True) #for pandas version 2.2.2

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [98]:
#Calculate average of the columns in the first 50 rows
# <your code goes here>
df.head(50).mean(numeric_only=True) #for pandas version 2.2.2

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [99]:
#Calculate how many values in the salary column (use count() method)
# <your code goes here>
df.count().salary

78

In [100]:
#Calculate the average salary
df['salary'].mean()

108023.78205128205

In [101]:
np.mean(df['salary'])

108023.78205128205

In [107]:
#Select column salary
df1 = df['salary']
df1.head()

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [108]:
df1.dtypes

dtype('int64')

### Sorting the Data

In [114]:
#Sort the data frame by yrs.service and create a new data frame
df_sorted = df.sort_values(by = 'service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [117]:
df_sorted.tail(10) 

#จากแถวสุดท้าย

    rank discipline  phd  service     sex  salary
21  Prof          A   33       30    Male  103106
25  Prof          B   35       31    Male   99418
3   Prof          A   40       31    Male  131205
13  Prof          B   35       33    Male  162200
10  Prof          B   39       33    Male  128250
40  Prof          A   39       36  Female  137000
27  Prof          A   45       43    Male  155865
36  Prof          B   45       45    Male  146856
0   Prof          B   56       49    Male  186960
9   Prof          A   51       51    Male   57800

In [110]:
#Sort the data frame by yrs.service and overwrite the original dataset
df.sort_values(by = 'service', ascending = False, inplace = True)
df.head()

#ascending = False เรียงจากมากไปน้อย

    rank discipline  phd  service     sex  salary
9   Prof          A   51       51    Male   57800
0   Prof          B   56       49    Male  186960
36  Prof          B   45       45    Male  146856
27  Prof          A   45       43    Male  155865
40  Prof          A   39       36  Female  137000

In [111]:
# Restore the original order (by sorting using index)
df.sort_index(axis=0, ascending = True, inplace = True)
df.head()

#axis=0 index 0-N

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [70]:
# Sort data frame by the salary (in descending order) and display the first few records of the output (head)
df.sort_values(by = "salary", ascending = False).head(10)

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
72  Prof          B   24       15  Female  161101
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
14  Prof          B   25       19    Male  153750
44  Prof          B   23       19  Female  151768
19  Prof          A   29       27    Male  150500
15  Prof          B   17        3    Male  150480
26  Prof          A   38       19    Male  148750

In [71]:
#Sort the data frame using 2 or more columns:
df_sorted = df.sort_values(by = ['service', 'salary'], ascending = [True,False])
df_sorted.head(10)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500